athurg/linux_kernel/arch/arm/mach-lpc32xx/include/mach/lpc32xx_clkpwr.h
/* Macro for loading IRDA 'Y' divider value */
#define CLKPWR_IRDA_Y_DIV(y)       ((y) & 0xFF)
/* Macro for loading IRDA 'X' divider value */
#define CLKPWR_IRDA_X_DIV(x)       (((x) & 0xFF) << 8)

/**********************************************************************
* clkpwr_uart_clk_ctrl register definitions
**********************************************************************/
/* UART6 clock disable (0) / enable (1) bit */
#define CLKPWR_UARTCLKCTRL_UART6_EN _BIT(3)
/* UART5 clock disable (0) / enable (1) bit */
#define CLKPWR_UARTCLKCTRL_UART5_EN _BIT(2)
/* UART4 clock disable (0) / enable (1) bit */
#define CLKPWR_UARTCLKCTRL_UART4_EN _BIT(1)
/* UART3 clock disable (0) / enable (1) bit */
#define CLKPWR_UARTCLKCTRL_UART3_EN _BIT(0)

/**********************************************************************
* clkpwr_dmaclk_ctrl register definitions
**********************************************************************/
/* DMA clock disable (0) / enable (1) bit */
#define CLKPWR_DMACLKCTRL_CLK_EN   0x1

/**********************************************************************
* clkpwr_autoclock register definitions
**********************************************************************/
/* (0) = enable USB autoclock, (1) = always clock */
#define CLKPWR_AUTOCLK_USB_EN      0x40
/* (0) = enable IRAM autoclock, (1) = always clock */
#define CLKPWR_AUTOCLK_IRAM_EN     0x02
/* (0) = enable IROM autoclock, (1) = always clock */
#define CLKPWR_AUTOCLK_IROM_EN     0x01

#endif /* LPC32XX_CLKPWR_H */
